### Summary of Datasets

Below is a brief summary of all of the datasets that we used to conduct analysis for this project.

#### (1) Larvae Dataset

Contains information on, time (year),location (latitude/longitude), and the amount (in pounds) of larvae caught. The catch data is sorted by larvae species.

The dataset is very sparse, since the majority of cruises caught zero pounds of a given larvae species. Scroll through and see just how many types of fish there are, and how few are caught per cruise!

In [3]:
# contains code to import 3 datasets to be displayed further on the page

import pandas as pd
larval_df = pd.read_csv('data/Fishlarvaldata_Capstone_2021_FromAndrewThompson_updated 1804 1904 1507 1607 1601 1704 1604 1501 1407 1311 ichthyoplankton by line and station.csv')
commercial_fishery_df = pd.read_csv('data/LandingSummaryExtract-Satterthwaite_Monthly.CSV')
fishery_updated = pd.read_csv('data/2232021_SummaryByQuarter_blockgrouping_87-20_210223_Redacted.csv')

In [2]:
# select columns to show
cols_to_display_larval = ['longitude','latitude','year','season','Engraulis.mordax','Trachurus.symmetricus',
'Scomber.japonicus','Lampridiformes1','Sardinops.sagax','Seriola.lalandi']

# print head of selected columns
larval_df[cols_to_display_larval].head(5)

,longitude,latitude,year,season,Engraulis.mordax,Trachurus.symmetricus,Scomber.japonicus,Lampridiformes1,Sardinops.sagax,Seriola.lalandi
0,-120.776667,35.086667,2019,spring,0.000000,0.0,0.0,0.0,0.0,0.0
1,-120.915000,35.021667,2019,spring,0.000000,0.0,0.0,0.0,0.0,0.0
2,-121.196667,34.890000,2019,spring,36.666667,0.0,0.0,0.0,0.0,0.0
3,-121.551667,34.720000,2019,spring,40.720000,0.0,0.0,0.0,0.0,0.0
4,-122.245000,34.390000,2019,spring,4.850000,0.0,0.0,0.0,0.0,0.0

#### (2) Commercial Fishery Dataset

Contains information on time (year/month), location (latitude/longitude), amount of fish caught (pounds), and the price-per-pound of that fish in the given catch year (dollars).

Due to data privacy rules, some of the information relating to price-per-pound and pounds caught are redacted.

In [4]:
# remove NAs from fishery data
cleaned_fishery = fishery_updated.dropna(how='any')
cleaned_fishery = cleaned_fishery[cleaned_fishery['Total Price'] != ' ']

# print data
cleaned_fishery.head(5)

   Year Quarter  GroupBlocks  Species ID Species Name  Pounds Total Price
0  1987   Qtr 1       1032.0        40.0   Yellowtail   256.0       $272
3  1987   Qtr 2       1032.0        40.0   Yellowtail  1710.0     $1,511
5  1987   Qtr 2       1034.0        40.0   Yellowtail  1417.0     $1,177
6  1987   Qtr 2       1035.0        40.0   Yellowtail  6457.0     $6,267
8  1987   Qtr 2        600.0        40.0   Yellowtail  3071.0     $2,644

#### (3) Block Grouping Dataset

(insert info about block grouping dataset here)

In [ ]:
 ## To Do: Add block data set